b = 0

# Текст, у якого треба порахувати пробіли та скільки питальних речень.(скільки ком)
for i in 'Привіт, чи не хочеш ти навчитися програмувати? Хочу!, але це тяжко напевне, та ні хлопче, це дуже просто.':
    if i == ',':
        b+=1

print(b)


b = 0

# Скільки речень в тексті
for i in 'Привіт, чи не хочеш ти навчитися програмувати?. Хочу!, але це тяжко напевне, та ні хлопче, це дуже просто.':
    if i == '.':
        b+=1

print(b)


b = 0

# Скільки питальних речень
for i in 'Привіт, чи не хочеш ти навчитися програмувати? Хочу!, але це тяжко напевне, та ні хлопче, це дуже просто.':
    if i == '?':
        b+=1

print(b)


b = 0

# Скільки питальних речень
for i in 'Привіт, чи не хочеш ти навчитися програмувати? Хочу!, але це тяжко напевне, та ні хлопче, це дуже просто.':
    if i == '!':
        b+=1

print(b)